andresnalegre/lotei-qflipper/build_mac/dfu/moc_stm32wb55.cpp
/****************************************************************************
** Meta object code from reading C++ file 'stm32wb55.h'
**
** Created by: The Qt Meta Object Compiler version 69 (Qt 6.11.1)
**
** WARNING! All changes made in this file will be lost!
*****************************************************************************/

#include "../../dfu/device/stm32wb55/stm32wb55.h"
#include <QtCore/qmetatype.h>

#include <QtCore/qtmochelpers.h>

#include <memory>


#include <QtCore/qxptype_traits.h>
#if !defined(Q_MOC_OUTPUT_REVISION)
#error "The header file 'stm32wb55.h' doesn't include <QObject>."
#elif Q_MOC_OUTPUT_REVISION != 69
#error "This file was generated using the moc from 6.11.1. It"
#error "cannot be used with the include files from this version of Qt."
#error "(The moc has changed too much.)"
#endif

#ifndef Q_CONSTINIT
#define Q_CONSTINIT
#endif

QT_WARNING_PUSH
QT_WARNING_DISABLE_DEPRECATED
QT_WARNING_DISABLE_GCC("-Wuseless-cast")
namespace {
struct qt_meta_tag_ZN5STM329STM32WB55E_t {};
} // unnamed namespace

template <> constexpr inline auto STM32::STM32WB55::qt_create_metaobjectdata<qt_meta_tag_ZN5STM329STM32WB55E_t>()
{
    namespace QMC = QtMocConstants;
    QtMocHelpers::StringRefStorage qt_stringData {
        "STM32::STM32WB55"
    };

    QtMocHelpers::UintData qt_methods {
    };
    QtMocHelpers::UintData qt_properties {
    };
    QtMocHelpers::UintData qt_enums {
    };
    return QtMocHelpers::metaObjectData<STM32WB55, qt_meta_tag_ZN5STM329STM32WB55E_t>(QMC::MetaObjectFlag{}, qt_stringData,
            qt_methods, qt_properties, qt_enums);
}
Q_CONSTINIT const QMetaObject STM32::STM32WB55::staticMetaObject = { {
    QMetaObject::SuperData::link<DfuseDevice::staticMetaObject>(),
    qt_staticMetaObjectStaticContent<qt_meta_tag_ZN5STM329STM32WB55E_t>.stringdata,
    qt_staticMetaObjectStaticContent<qt_meta_tag_ZN5STM329STM32WB55E_t>.data,
    qt_static_metacall,
    nullptr,
    qt_staticMetaObjectRelocatingContent<qt_meta_tag_ZN5STM329STM32WB55E_t>.metaTypes,
    nullptr
} };

void STM32::STM32WB55::qt_static_metacall(QObject *_o, QMetaObject::Call _c, int _id, void **_a)
{
    auto *_t = static_cast<STM32WB55 *>(_o);
    (void)_t;
    (void)_c;
    (void)_id;
    (void)_a;
}

const QMetaObject *STM32::STM32WB55::metaObject() const
{
    return QObject::d_ptr->metaObject ? QObject::d_ptr->dynamicMetaObject() : &staticMetaObject;
}

void *STM32::STM32WB55::qt_metacast(const char *_clname)
{
    if (!_clname) return nullptr;
    if (!strcmp(_clname, qt_staticMetaObjectStaticContent<qt_meta_tag_ZN5STM329STM32WB55E_t>.strings))
        return static_cast<void*>(this);
    return DfuseDevice::qt_metacast(_clname);
}

int STM32::STM32WB55::qt_metacall(QMetaObject::Call _c, int _id, void **_a)
{
    _id = DfuseDevice::qt_metacall(_c, _id, _a);
    return _id;
}
QT_WARNING_POP
